# 2. Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо
# заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.

import random

len_array_1 = 10
min_array_1 = -100
max_array_1 = 100

array_1 = [random.randint(min_array_1, max_array_1) for _ in range(len_array_1)]

# Решение. Индексация начинается с 0 конечно! (непонятна эта двойственность в условии)
array_2 = [i for i in range(len(array_1)) if array_1[i] % 2 == 0]
print('array_1: ', array_1)
print('array_2: ', array_2)
